In [2]:
import pandas as pd
df2= {'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','Royals'],
            'Rank':[1,2,2,3,3,4,1,1,2,4,1,2],
            'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
            'Points':[876,789,863,673,741,812,756,788,694,701,884,690],
            
           }
df=pd.DataFrame(df2)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     884
11  Royals     2  2017     690

In [3]:
# Q1. Har team ka year-wise average points nikaalo aur batao kaunsi team me sabse zyada consistency hai.
df.pivot_table(
    index='Year',
    columns='Team',
    values='Points',
    aggfunc='mean',
    fill_value=0,
    margins=True
    
)

Team  Devils   Kings      Riders      Royals     All
Year
2014   863.0  741.00  876.000000  701.000000  795.25
2015   673.0  812.00  789.000000  884.000000  789.50
2016     0.0  756.00  694.000000    0.000000  725.00
2017     0.0  788.00    0.000000  690.000000  739.00
All    768.0  774.25  786.333333  758.333333  772.25

In [4]:
# Q2. Kaunsi team ne Rank 1 sabse zyada baar achieve kiya hai?
df[df['Rank']==1]['Team'].value_counts()

Team
Kings     2
Riders    1
Royals    1
Name: count, dtype: int64

In [5]:
# Q3. Har year ke liye highest points wali team ka naam aur points nikaalo.
df.loc[df.groupby('Year')['Points'].idxmax()]

      Team  Rank  Year  Points
0   Riders     1  2014     876
10  Royals     1  2015     884
6    Kings     1  2016     756
7    Kings     1  2017     788

In [6]:
# Q4. Har team ke liye best year (maximum points) identify karo.
df.loc[df.groupby('Team')['Points'].idxmax()]

      Team  Rank  Year  Points
2   Devils     2  2014     863
5    Kings     4  2015     812
0   Riders     1  2014     876
10  Royals     1  2015     884

In [7]:
# Q5. 2014 aur 2015 ke beech kis team ka performance sabse zyada improve hua (points ke basis par)?
df_14_15 = df[df['Year'].isin([2014, 2015])]
df_14_15

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
9   Royals     4  2014     701
10  Royals     1  2015     884

In [8]:
pivot=df_14_15.pivot(
     index='Team',
     columns='Year',
     values='Points',
     
 )
pivot

Year    2014  2015
Team
Devils   863   673
Kings    741   812
Riders   876   789
Royals   701   884

In [9]:
pivot['Improvement']=pivot[2015]-pivot[2014]
pivot

Year    2014  2015  Improvement
Team
Devils   863   673         -190
Kings    741   812           71
Riders   876   789          -87
Royals   701   884          183

In [10]:
pivot['Improvement'].idxmax()

'Royals'

In [11]:
# Q6. jo kam se kam 2 alag-alag years me Rank 1 par rahi ho.
df[df['Rank']==1]['Team'].value_counts()[lambda x: x>=2]

Team
Kings    2
Name: count, dtype: int64

In [12]:
# Q7 . Har team ka: average rank, average points nikalo aur analyze karo Kya better rank hamesha better points ka sign hai?
team_avg = df.groupby('Team')[['Rank', 'Points']].mean()
team_avg

            Rank      Points
Team
Devils  2.500000  768.000000
Kings   2.250000  774.250000
Riders  1.666667  786.333333
Royals  2.333333  758.333333

In [13]:
team_avg['Rank'].corr(team_avg['Points'])

np.float64(-0.8283400687891124)

In [21]:
# Q8 Kaunsi team ka points trend unstable hai?
df.groupby('Team')['Points'].std().sort_values(ascending=False)

Team
Devils    134.350288
Royals    108.969415
Riders     91.029299
Kings      31.899582
Name: Points, dtype: float64

In [29]:
# q9 Har year me: Rank aur Points ke beech correlation nikaalo Kya lower rank (1) hamesha higher points deta hai?
df.groupby('Year').apply(
    lambda x: x['Rank'].corr(x['Points'])
)

C:\Users\ABHISHEK YADAV\AppData\Local\Temp\ipykernel_9132\800150031.py:2: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('Year').apply(

Year
2014   -0.955264
2015   -0.489412
2016   -1.000000
2017   -1.000000
dtype: float64

In [31]:
# Q10. Aisi teams identify karo jo Rank 1 par aayi lekin us year highest points nahi the?
max_points = df.groupby('Year')['Points'].transform('max')
max_points

0     876
1     884
2     876
3     884
4     876
5     884
6     756
7     788
8     756
9     876
10    884
11    788
Name: Points, dtype: int64

In [33]:
rank1 = df[df['Rank'] == 1]
rank1

      Team  Rank  Year  Points
0   Riders     1  2014     876
6    Kings     1  2016     756
7    Kings     1  2017     788
10  Royals     1  2015     884